---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
--- 统一注册 【 images\map_icons 】 里的所有图标
--- 每个 xml 里面 只有一个 tex

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

if Assets == nil then
    Assets = {}
end

local files_name = {
	-------------------------------------------------------------------------------------------------
	---- 00_loramia_others
	---- 22_loramia_npc
	-------------------------------------------------------------------------------------------------
		"loramia",						--- 小地图图标
	-------------------------------------------------------------------------------------------------
	---- 06_buildings
		"loramia_building_sharpstrike_creation",						--- 发电机
		"loramia_building_analytic_creation",							--- 解析的创造物
		"loramia_building_mysterious_creation",							--- 神秘的创造物  帐篷

	-------------------------------------------------------------------------------------------------


}

for k, name in pairs(files_name) do
    table.insert(Assets, Asset( "IMAGE", "images/map_icons/".. name ..".tex" ))
    table.insert(Assets, Asset( "ATLAS", "images/map_icons/".. name ..".xml" ))
	AddMinimapAtlas("images/map_icons/".. name ..".xml")
	RegisterInventoryItemAtlas("images/map_icons/".. name ..".xml",name..".tex")	
end


